tests/load/products-load-test.yml
# Load Testing Configuration
# Run with: npx artillery run tests/load/products-load-test.yml

config:
  target: "http://localhost:3001"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    
    # Ramp up
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    
    # Sustained load
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 1
    p95: 500
    p99: 1000

scenarios:
  # Scenario 1: Browse products
  - name: "Browse products"
    weight: 50
    flow:
      - get:
          url: "/products"
      - think: 2
      - get:
          url: "/products?page={{ $randomNumber(1, 10) }}"
      - think: 1
      - get:
          url: "/products?category=Electronics"

  # Scenario 2: View product details
  - name: "View product details"
    weight: 30
    flow:
      - get:
          url: "/products"
          capture:
            - json: "$.products[0]._id"
              as: "productId"
      - think: 1
      - get:
          url: "/products/{{ productId }}"

  # Scenario 3: Search products
  - name: "Search products"
    weight: 20
    flow:
      - get:
          url: "/products?search=laptop"
      - think: 2
      - get:
          url: "/products?search=phone&minPrice=100&maxPrice=1000"