tests/load/spike-test.yml
# Spike Load Test - Test system under sudden load
# Run with: npx artillery run tests/load/spike-test.yml

config:
  target: "http://localhost:3001"
  phases:
    # Normal load
    - duration: 60
      arrivalRate: 10
      name: "Normal load"
    
    # Sudden spike
    - duration: 30
      arrivalRate: 200
      name: "Spike"
    
    # Recovery
    - duration: 60
      arrivalRate: 10
      name: "Recovery"

  ensure:
    maxErrorRate: 5
    p95: 1000
    p99: 2000

scenarios:
  - name: "Mixed load"
    flow:
      - get:
          url: "/products"
      - get:
          url: "/health"